;================================================================
; Файл инициализации для библиотеки опроса кнопки
; 
; АХТУНГ!!! Файл располагать в сегменте кода, в файле инит!!!
;================================================================

ButOprosInit:

	cbi		BUT_DDR,BUT_UP
	cbi		BUT_DDR,BUT_DWN
	cbi		BUT_DDR,BUT_ENTER

	clr		buttons

;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
; инициализация таймера опроса кнопки
;++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	ldi		tempreg,ButOpros_tmr_init
	sts		ButOpros_timer,tempreg

	ret
