;================================================================
; Дефайны для библиотеки пищалки (со встроенным генератором)
; 
; АХТУНГ!!! Файл располагать в сегменте кода, в файле дефайнов!!!
;================================================================

	#define		BUZZER_DDR			DDRC
	#define		BUZZER_PORT			PORTC
	
	#define		BUZZER				0

;----------------------------------------------------------------
; Макрокоманды пищалки
;----------------------------------------------------------------
.MACRO		BUZZER_ON
	sbi		BUZZER_PORT,BUZZER
.ENDM

.MACRO		BUZZER_OFF
	cbi		BUZZER_PORT,BUZZER
.ENDM
